# Joules Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..Joules Property
UnitTypeId Class See Also
---
Joules.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Joules { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Joules As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Joules {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace